# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Packages
brew "arp-scan"
brew "bat"
brew "coreutils"
brew "diff-so-fancy"
brew "fd"
brew "fzf"
brew "gist"
brew "git"
brew "glances"
brew "gnupg"
brew "gnu-sed"
brew "htop"
brew "httpie"
brew "hub"
brew "lolcat"
brew "lynx"
brew "nmap"
brew "mas"
brew "micro"
brew "mycli"
brew "mysql", restart_service: :changed
brew "ncdu"
brew "neofetch"
brew "node"
brew "pigz"
brew "pinentry-mac"
brew "ranger"
# Required for tmux-yank
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "vegeta"
brew "wget"
brew "yarn"

# Casks
cask "alfred"
cask "atom"
cask "bettertouchtool"
cask "betterzip"
cask "disk-inventory-x"
cask "firefox"
cask "firefox-developer-edition"
cask "firefox-nightly"
cask "flux"
cask "font-fira-code"
cask "google-chrome"
cask "handbrake"
cask "iina"
cask "kap"
cask "macs-fan-control"
cask "mactracker"
cask "mysqlworkbench"
cask "osxfuse"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "sizeup"
cask "spotify"
cask "visual-studio-code"

# MAS Apps
mas "Keynote", id: 409183694
mas "MiniPlay", id: 936243210
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Trello", id: 1278508951
mas "Unsplash Wallpapers", id: 1284863847
mas "Wipr", id: 1320666476
